; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v13 ?v11)
             (pred_11 ?v3 ?v9)
             (pred_10 ?v13 ?v9)
             (pred_12 ?v5 ?v13 )
	     (pred_8 ?v13)
             (pred_4 ?v7)
             (pred_3 ?v3)
             (pred_6 ?v9)
             (pred_9 ?v13)
             (pred_1 ?v3)
             (pred_5 ?v13)
             (pred_7 ))



(:action op_3
:parameters (?v1 ?v2 ?v4 ?v10)
:precondition (and (pred_4 ?v1) (pred_4 ?v2) (pred_3 ?v4) (pred_6 ?v10)
          (pred_2 ?v1 ?v2) (pred_11 ?v4 ?v10)
                   (pred_10 ?v2 ?v10) (pred_8 ?v1) 
                   (pred_9 ?v2) (pred_1 ?v4))
:effect (and  (pred_5 ?v2) (not (pred_9 ?v2))))


(:action op_5
:parameters (?v1 ?v8)
:precondition (and (pred_4 ?v1) (pred_4 ?v8)
               (pred_8 ?v1) (pred_2 ?v1 ?v8) (pred_5 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v1))))

(:action op_2
:parameters (?v1 ?v4)
:precondition (and (pred_4 ?v1) (pred_3 ?v4) 
                  (pred_8 ?v1) (pred_12 ?v4 ?v1) (pred_7 ))
:effect (and (pred_1 ?v4)
   (not (pred_12 ?v4 ?v1)) (not (pred_7 ))))


(:action op_1
:parameters (?v1 ?v12 ?v6)
:precondition (and (pred_4 ?v1) (pred_3 ?v12) (pred_3 ?v6)
                  (pred_8 ?v1) (pred_1 ?v6) (pred_12 ?v12 ?v1))
:effect (and (pred_1 ?v12) (pred_12 ?v6 ?v1)
        (not (pred_1 ?v6)) (not (pred_12 ?v12 ?v1))))

(:action op_4
:parameters (?v1 ?v4)
:precondition (and (pred_4 ?v1) (pred_3 ?v4) 
                  (pred_8 ?v1) (pred_1 ?v4))
:effect (and (pred_7 ) (pred_12 ?v4 ?v1) (not (pred_1 ?v4)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_06 obj_18 obj_07 obj_22 obj_04 obj_17 obj_03 obj_08 obj_13 obj_05 obj_01 obj_12 obj_21 obj_11 obj_10
    obj_02 obj_19 obj_15
    obj_09 obj_14 obj_20
    )

    (:init
       (pred_7)

       (pred_4 obj_16)
       (pred_4 obj_06)
       (pred_4 obj_18)
       (pred_4 obj_07)
       (pred_4 obj_22)
       (pred_4 obj_04)
       (pred_4 obj_17)
       (pred_4 obj_03)
       (pred_4 obj_08)
       (pred_4 obj_13)
       (pred_4 obj_05)
       (pred_4 obj_01)
       (pred_4 obj_12)
       (pred_4 obj_21)
       (pred_4 obj_11)
       (pred_4 obj_10)
       (pred_6 obj_02)
       (pred_6 obj_19)
       (pred_6 obj_15)
       (pred_3 obj_09)
       (pred_3 obj_14)
       (pred_3 obj_20)

       (pred_2 obj_16 obj_22)
       (pred_2 obj_16 obj_06)
       (pred_2 obj_06 obj_04)
       (pred_2 obj_06 obj_18)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_18 obj_17)
       (pred_2 obj_18 obj_07)
       (pred_2 obj_18 obj_06)
       (pred_2 obj_07 obj_03)
       (pred_2 obj_07 obj_18)
       (pred_2 obj_22 obj_08)
       (pred_2 obj_22 obj_04)
       (pred_2 obj_22 obj_16)
       (pred_2 obj_04 obj_13)
       (pred_2 obj_04 obj_17)
       (pred_2 obj_04 obj_06)
       (pred_2 obj_04 obj_22)
       (pred_2 obj_17 obj_05)
       (pred_2 obj_17 obj_03)
       (pred_2 obj_17 obj_18)
       (pred_2 obj_17 obj_04)
       (pred_2 obj_03 obj_01)
       (pred_2 obj_03 obj_07)
       (pred_2 obj_03 obj_17)
       (pred_2 obj_08 obj_12)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_08 obj_22)
       (pred_2 obj_13 obj_21)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_04)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_05 obj_11)
       (pred_2 obj_05 obj_01)
       (pred_2 obj_05 obj_17)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_01 obj_10)
       (pred_2 obj_01 obj_03)
       (pred_2 obj_01 obj_05)
       (pred_2 obj_12 obj_21)
       (pred_2 obj_12 obj_08)
       (pred_2 obj_21 obj_11)
       (pred_2 obj_21 obj_13)
       (pred_2 obj_21 obj_12)
       (pred_2 obj_11 obj_10)
       (pred_2 obj_11 obj_05)
       (pred_2 obj_11 obj_21)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_10 obj_11)
       (pred_9 obj_03)
       (pred_9 obj_16)
       (pred_9 obj_01)
       (pred_10  obj_03 obj_02)
       (pred_10  obj_16 obj_19)
       (pred_10  obj_01 obj_15)
       (pred_5 obj_06)
       (pred_5 obj_18)
       (pred_5 obj_07)
       (pred_5 obj_22)
       (pred_5 obj_04)
       (pred_5 obj_17)
       (pred_5 obj_08)
       (pred_5 obj_13)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_21)
       (pred_5 obj_11)
       (pred_5 obj_10)

       (pred_11  obj_09 obj_02)
       (pred_11  obj_14 obj_19)
       (pred_11  obj_20 obj_15)
       (pred_12 obj_09 obj_17)
       (pred_12 obj_14 obj_11)
       (pred_12 obj_20 obj_07)
       (pred_8 obj_11)
    )

    (:goal (and
       (pred_12 obj_14 obj_21)
       (pred_12 obj_20 obj_06)
    ))
(:constraints
  (always (not (pred_8 obj_13)))
)
)

; plan
1. (op_2 obj_11 obj_14)
   deleted: (pred_12 obj_14 obj_11) (pred_7)
   added: (pred_1 obj_14)
   goals met: 0 of 2
2. (op_5 obj_11 obj_21)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_21)
   goals met: 0 of 2
3. (op_4 obj_21 obj_14)
   deleted: (pred_1 obj_14)
   added: (pred_7) (pred_12 obj_14 obj_21)
   goals met: 1 of 2
4. (op_5 obj_21 obj_11)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_11)
   goals met: 1 of 2
5. (op_5 obj_11 obj_05)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_05)
   goals met: 1 of 2
6. (op_5 obj_05 obj_17)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_17)
   goals met: 1 of 2
7. (op_5 obj_17 obj_18)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_18)
   goals met: 1 of 2
8. (op_5 obj_18 obj_07)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_07)
   goals met: 1 of 2
9. (op_2 obj_07 obj_20)
   deleted: (pred_12 obj_20 obj_07) (pred_7)
   added: (pred_1 obj_20)
   goals met: 1 of 2
10. (op_5 obj_07 obj_18)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_18)
   goals met: 1 of 2
11. (op_5 obj_18 obj_06)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_06)
   goals met: 1 of 2
12. (op_4 obj_06 obj_20)
   deleted: (pred_1 obj_20)
   added: (pred_7) (pred_12 obj_20 obj_06)
   goals met: 2 of 2
